// Определяне на по-голямото от двойка цели числа – вариант 2
#include <iostream>

int main() {
    int a, b;
    int max;  // стойност на по-голямото от две числа
    // Въвеждане на двете цели числа a и b
    printf("a = ");
    std::cin >> a;
    printf("b = ");
    std::cin >> b;
    // Избор на по-голямото от двойка числа
    max = a;
    if (max < b)  // съкратена форма на оператор if
        max = b;
    // Извеждане на стойността на по-голямото число
    std::cout << "max = " << max << std::endl;
    return 0;
}